{"format": "graph-model", "generatedBy": "2.8.2", "convertedBy": "TensorFlow.js Converter v3.17.0", "signature": {"inputs": {"text_vectorization_input": {"name": "text_vectorization_input:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"dense_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/split/split_dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read_2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/embedding/NotEqual/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/ReverseV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/split/split_dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1000"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/text_vectorization/RaggedToTensor/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_1", "op": "Const", "attr": {"dtype": {"type": "DT_STRING"}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/sequential/text_vectorization/RaggedToTensor/default_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/sequential/text_vectorization/StringSplit/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/text_vectorization/StringSplit/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/text_vectorization/StringSplit/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/text_vectorization/StringSplit/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall/sequential/text_vectorization/StringSplit/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/text_vectorization/StringSplit/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/text_vectorization/StringSplit/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/embedding/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "text_vectorization_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_STRING"}}}, {"name": "unknown", "op": "Placeholder", "attr": {"dtype": {"type": "DT_RESOURCE"}, "shape": {"shape": {}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_54", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_55", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_56", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read_2/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_46", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/time"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_44", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/loop_counter"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_124", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_125", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_126", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read_2/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_116", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/time"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_114", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/sequential/text_vectorization/StringLower", "op": "StringLower", "input": ["text_vectorization_input"], "attr": {"encoding": {"s": ""}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_67", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_54", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_109"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_68", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_55", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_110"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_69", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_56", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_111"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_59", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_46", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_101"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_57", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_44", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_99"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_137", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_124", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_179"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_138", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_125", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_180"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_139", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_126", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_181"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_129", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_116", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_171"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_127", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_114", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_169"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/text_vectorization/StaticRegexReplace", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/sequential/text_vectorization/StringLower"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": ""}, "pattern": {"s": "WyEiIyQlJigpXCpcKywtXC4vOjs8PT4/QFxbXFxcXV5fYHt8fX5cJ10="}}}, {"name": "StatefulPartitionedCall/sequential/text_vectorization/StringSplit/StringSplitV2", "op": "StringSplitV2", "input": ["StatefulPartitionedCall/sequential/text_vectorization/StaticRegexReplace", "StatefulPartitionedCall/sequential/text_vectorization/StringSplit/Const"], "attr": {"maxsplit": {"i": "-1"}}}, {"name": "StatefulPartitionedCall/sequential/text_vectorization/StringSplit/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/text_vectorization/StringSplit/StringSplitV2", "StatefulPartitionedCall/sequential/text_vectorization/StringSplit/strided_slice/stack", "StatefulPartitionedCall/sequential/text_vectorization/StringSplit/strided_slice/stack_1", "StatefulPartitionedCall/sequential/text_vectorization/StringSplit/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "1"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "2"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/sequential/text_vectorization/string_lookup/Equal", "op": "Equal", "input": ["StatefulPartitionedCall/sequential/text_vectorization/StringSplit/StringSplitV2:1", "unknown_1"], "attr": {"T": {"type": "DT_STRING"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/text_vectorization/StringSplit/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/text_vectorization/StringSplit/StringSplitV2:2", "StatefulPartitionedCall/sequential/text_vectorization/StringSplit/strided_slice_1/stack", "StatefulPartitionedCall/sequential/text_vectorization/StringSplit/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential/text_vectorization/StringSplit/strided_slice_1/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT64"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/text_vectorization/string_lookup/None_Lookup/LookupTableFindV2", "op": "LookupTableFindV2", "input": ["unknown", "StatefulPartitionedCall/sequential/text_vectorization/StringSplit/StringSplitV2:1", "unknown_0"], "attr": {"Tout": {"type": "DT_INT64"}, "Tin": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall/sequential/text_vectorization/string_lookup/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/sequential/text_vectorization/string_lookup/Equal", "unknown_2", "StatefulPartitionedCall/sequential/text_vectorization/string_lookup/None_Lookup/LookupTableFindV2"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/sequential/text_vectorization/RaggedToTensor/RaggedTensorToTensor", "op": "RaggedTensorToTensor", "input": ["StatefulPartitionedCall/sequential/text_vectorization/RaggedToTensor/Const", "StatefulPartitionedCall/sequential/text_vectorization/string_lookup/SelectV2", "StatefulPartitionedCall/sequential/text_vectorization/RaggedToTensor/default_value", "StatefulPartitionedCall/sequential/text_vectorization/StringSplit/strided_slice_1", "StatefulPartitionedCall/sequential/text_vectorization/StringSplit/strided_slice"], "attr": {"Tindex": {"type": "DT_INT64"}, "Tshape": {"type": "DT_INT64"}, "row_partition_types": {"list": {"s": ["RklSU1RfRElNX1NJWkU=", "VkFMVUVfUk9XSURT"]}}, "T": {"type": "DT_INT64"}, "num_row_partition_tensors": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/embedding/NotEqual", "op": "NotEqual", "input": ["StatefulPartitionedCall/sequential/text_vectorization/RaggedToTensor/RaggedTensorToTensor", "StatefulPartitionedCall/sequential/embedding/NotEqual/y"], "attr": {"incompatible_shape_error": {"b": true}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/sequential/embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown_3", "StatefulPartitionedCall/sequential/text_vectorization/RaggedToTensor/RaggedTensorToTensor", "StatefulPartitionedCall/sequential/embedding/embedding_lookup/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential/embedding/NotEqual", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/ExpandDims/dim"], "attr": {"T": {"type": "DT_BOOL"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential/embedding/NotEqual", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/ExpandDims/dim"], "attr": {"T": {"type": "DT_BOOL"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/embedding/embedding_lookup"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential/embedding/embedding_lookup", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/embedding/embedding_lookup"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential/embedding/embedding_lookup", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/ExpandDims", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/transpose_1/perm"], "attr": {"T": {"type": "DT_BOOL"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/ExpandDims", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/transpose_1/perm"], "attr": {"T": {"type": "DT_BOOL"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Shape", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice/stack", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice/stack_1", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/transpose", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/transpose", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice_1/stack", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice_1/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Shape", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice/stack", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice/stack_1", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/ReverseV2", "op": "ReverseV2", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/transpose", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/ReverseV2/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/transpose", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice_1/stack", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice_1/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/transpose_1", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_BOOL"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_BOOL"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/ReverseV2_1", "op": "ReverseV2", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/transpose_1", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/ReverseV2_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_52", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice_1", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/Shape", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros_1/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros/packed/1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/ReverseV2", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice_1", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/Shape", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_53", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_BOOL"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/ReverseV2_1", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_BOOL"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_BOOL"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros_1/packed", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros/packed", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_65", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_52", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_107"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_51", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros_1/packed", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros/packed", 